# 消融实验：不使用跨尺度融合（直接使用主分支特征）
# Parameters
nc: 80   # number of classes

# Ablation study configuration
ablation:
  use_teacher: false
  use_small_branch: true
  use_ghost: true
  use_attention: true
  use_pos_encoding: true
  use_cross_scale_fusion: false   # ❌ 关闭跨尺度融合

# Backbone
backbone:
  - [custom, 1, YOLOv11SmallObjectDetector]

# Head
head:
  - [-1, 1, Detect, [nc]]

