# 消融实验：不使用位置编码
# Parameters
nc: 80 # number of classes

# Ablation study configuration
ablation:
  use_teacher: false
  use_small_branch: true
  use_ghost: true
  use_attention: true
  use_pos_encoding: false # ❌ 关闭位置编码
  use_cross_scale_fusion: true

# Backbone
backbone:
  - [custom, 1, YOLOv11SmallObjectDetector]

# Head
head:
  - [-1, 1, Detect, [nc]]
