# Parameters
nc: 80   # number of classes

# Backbone
backbone:
  - [custom, 1, YOLOv11SmallObjectDetector]

# Head (minimal head required for parsing)
head:
  - [-1, 1, Detect, [nc]]  # Detect layer
